{
  "architectures": [
    "MixtralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 15,
  "eos_token_id": 16,
  "head_dim": null,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.01,
  "intermediate_size": 4096,
  "iter": 118698,
  "max_position_embeddings": 1048576,
  "model_type": "mixtral",
  "num_attention_heads": 16,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 12,
  "num_key_value_heads": 8,
  "num_local_experts": 8,
  "output_router_logits": false,
  "pad_token_id": 14,
  "rms_norm_eps": 1e-05,
  "rope_theta": 50000000,
  "router_aux_loss_coef": 0.001,
  "router_jitter_noise": 0.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4",
  "use_cache": true,
  "vocab_size": 128
}
